rottenpotatoes/app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
SELECT "movies".* FROM "movies" WHERE "movies"."Director" = 'Liang'
---
  def same_director
    @target = Movie.find(params[:id])
    director = @target.director
    if (director.blank?) then
      flash[:notice] = "'#{@target.title}' has no director info"
      redirect_to movies_path
    else
      @movies = Movie.where(Director: director)